nxp-mcuxpresso/mcux-soc-svd/KW47Z42092/KW47Z42092.xml
        <register>
          <name>MRCC_LPTMR2_IPG_CLK_ERCLK_WAKE2VSYS</name>
          <description>LPTMR2_IPG_CLK_ERCLK_WAKE2VSYS reset and clock control</description>
          <addressOffset>0x448</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CC</name>
              <description>Clock Config</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Peripheral clocks are disabled, module does not stall low power mode entry</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Peripheral clocks are enabled, module does not stall low power mode entry</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HW</name>
                  <description>Peripherals clocks are enabled unless peripheral is idle, low power mode entry will stall until peripheral is idle</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON_UNTIL_SLEEP</name>
                  <description>Peripheral clocks are enabled unless in SLEEP mode (or lower), low power mode entry will stall until peripheral is idle Peripheral functional clocks that remain enabled in SLEEP mode are enabled and do not stall low power mode entry unless entering DEEPSLEEP mode (or lower)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SFA0</name>
      <description>Signal Frequency Analyser</description>
      <groupName>SFA</groupName>
      <baseAddress>0x4001D000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x38</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SFA0</name>
        <value>26</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Signal Frequency Analyser (SFA) Control</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>MEASUREMENT MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>mode0</name>
                  <description>Frequency measurement performed with REF frequency &gt; CUT Frequency.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mode1</name>
                  <description>Frequency measurement performed with REF frequency &lt; CUT Frequency.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mode2</name>
                  <description>CUT period measurement performed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mode3</name>
                  <description>Trigger based measurement performed. Note, each trigger pulse must be held for at least 2 ref_clk cycles.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG_START_POL</name>
              <description>Trigger Start Polarity</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG_START_POL0</name>
                  <description>Rising edge of TRIGGER[TRIG_START_SEL] will begin the measurement sequence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_START_POL1</name>
                  <description>Falling edge of TRIGGER[TRIG_START_SEL] will begin the measurement sequence.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG_END_POL</name>
              <description>Trigger End Polarity</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRIG_END_POL0</name>
                  <description>Rising edge of TRIGER[TRIG_END_SEL] will end the measurement sequence.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG_END_POL1</name>
                  <description>Falling edge of TRIGGER[TRIG_END_SEL] will end the measurement sequence.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SFA_TRIG_MEAS_EN</name>
              <description>SFA Triggered Measurement Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SFA_TRIG_MEAS_EN0</name>
                  <description>The measurement will start by default with a dummy write to the REF and CUT counters.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFA_TRIG_MEAS_EN1</name>
                  <description>The measurement will start after receiving a dummy write to the REF_CNT followed by receiving the trigger edge selected by TRIG_START_SEL and TRIG_START_POL.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SFA_IRQ_EN</name>
              <description>SFA Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SFA_IRQ_EN0</name>
                  <description>Interrupts are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFA_IRQ_EN1</name>
                  <description>Interrupts are enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SFA_EN</name>
              <description>SFA Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SFA_EN0</name>
                  <description>The SFA is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFA_EN1</name>
                  <description>The SFA is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MONITOR_EN</name>
              <description>Monitor Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MONITOR_EN0</name>
                  <description>Not in monitor mode .</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MONITOR_EN1</name>
                  <description>In monitor mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIG_START_SEL</name>
              <description>Signal MUX For Trigger Based Measurement Start</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIG_END_SEL</name>
              <description>Signal MUX For Trigger Based Measurement End</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUT_PREDIV</name>
              <description>CUT_PREDIV</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CUT_PREDIV0</name>
                  <description>No Divide</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV1</name>
                  <description>No Divide</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV2</name>
                  <description>Divide by 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV3</name>
                  <description>Divide by 2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV4</name>
                  <description>Divide by 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV5</name>
                  <description>Divide by 4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV6</name>
                  <description>Divide by 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV7</name>
                  <description>Divide by 6</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV8</name>
                  <description>Divide by 8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV9</name>
                  <description>Divide by 8</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIVa_10</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIVa_11</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIVa_12</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIVa_13</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIVa_14</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIVa_15</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIVa_16</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIVa_17</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIVa_18</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIVa_19</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIVa_248</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xF8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIVa_249</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xF9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIVa_250</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xFA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIVa_251</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xFB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIVa_252</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xFC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIVa_253</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xFD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIVe</name>
                  <description>Divide by 254</description>
                  <value>0xFE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIVf</name>
                  <description>Divide by 254</description>
                  <value>0xFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CUT_SEL</name>
              <description>CUT_SEL</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUT_PIN_EN</name>
              <description>CUT_PIN_EN</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_EXT</name>
          <description>Signal Frequency Analyser (SFA) Control Extended</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CUT_CLK_EN</name>
              <description>CUT_CLK_EN</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT_STAT</name>
          <description>Signal Frequency Analyser Count Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF_STOPPED</name>
              <description>REF_STOPPED</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CUT_STOPPED</name>
              <description>CUT_STOPPED</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEAS_STARTED</name>
              <description>Measurement Started Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REF_CNT_TIMEOUT</name>
              <description>Reference Counter Time Out</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SFA_IRQ</name>
              <description>SFA Interrupt Request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>FREQ_GT_MAX_IRQ</name>
              <description>FREQ_GT_MAX interrupt flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>FREQ_LT_MIN_IRQ</name>
              <description>FREQ_LT_MIN interrupt flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CUT_CNT</name>
          <description>Signal Frequency Analyser Clock Under Test Counter</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CUT_CNT</name>
              <description>CUT_CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_CNT</name>
          <description>Signal Frequency Analyser Reference Clock Counter</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF_CNT</name>
              <description>REF_CNT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CUT_TARGET</name>
          <description>Signal Frequency Analyser Clock Under Test Target Count</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CUT_TARGET</name>
              <description>CUT_TARGET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_TARGET</name>
          <description>Signal Frequency Analyser Reference Clock Target Count</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF_TARGET</name>
              <description>REF_TARGET</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_CNT_ST_SAVED</name>
          <description>Signal Frequency Analyser Reference Clock Count Start Saved Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF_CNT_ST_SAVED</name>
              <description>REF_CNT_ST_SAVED</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REF_CNT_END_SAVED</name>
          <description>Signal Frequency Analyser Reference Clock Count End Saved Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF_CNT_END_SAVED</name>
              <description>REF_CNT_END_SAVED</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
